#!.venv/bin/python

import numpy as np
"""
A= [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]]
通过列表A创建的矩阵arr1
 [[ 1  2  3  4]
 [ 5  6  7  8]
 [ 9 10 11 12]]
B= ((1, 2, 3, 4), (5, 6, 7, 8), (9, 10, 11, 12))
通过列表A创建的矩阵arr2
 [[ 1  2  3  4]
 [ 5  6  7  8]
 [ 9 10 11 12]]
arr1的大小： (3, 4)
D的特征值是
 [3. 6.]
D的特征值是
 [[-0.89442719 -0.70710678]
 [ 0.4472136  -0.70710678]]
"""
A = [[1,2,3,4],[5,6,7,8],[9,10,11,12]]
arr1 = np.array(A) # 将列表转为矩阵
print("A=",A)
print("通过列表A创建的矩阵arr1\n",arr1)

B=((1,2,3,4),(5,6,7,8),(9,10,11,12))
arr2 = np.array(B) # 将元组转为矩阵
print("B=",B)
print("通过列表A创建的矩阵arr2\n",arr2)

print("arr1的大小：",arr1.shape) #获取矩阵的规模


C=[[4,2],[1,5]]
D= np.array(C)

eig_val,eig_vex = np.linalg.eig(D) # 使用eig() 函数求解特征值和特征向量
print("D的特征值是\n", eig_val)
print("D的特征值是\n", eig_vex)
